# DataFrame:
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

#### Features of DataFrame
        Potentially columns are of different types
        Size – Mutable
        Labeled axes (rows and columns)
        Can Perform Arithmetic operations on rows and columns

## pandas.DataFrame

A pandas DataFrame can be created using the following constructs −

pandas.DataFrame( data, index, columns, dtype, copy)

pandas.DataFrame(data,row,column,dtype)

## Create DataFrame
    A pandas DataFrame can be created using various inputs like −

      #  Lists
      #  dict
      #  Series
      #  Numpy ndarrays
      #  Another DataFrame

# Sample Data

In [2]:
#Lets Create an empty dataFrame
import pandas as pd
#data,index,columns,dtype

In [ ]:
pd.DataFrame()

In [3]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

## DataFrame using Lists

In [4]:
d = [10,12,14,15]
df=pd.DataFrame(d)
df

    0
0  10
1  12
2  14
3  15

In [5]:
pd.Series(d)

0    10
1    12
2    14
3    15
dtype: int64

#### Create a DataFrame using multiple list/list of list

In [6]:
data=[['A',53],['B',52],['C',53]]
df=pd.DataFrame(data)
df

   0   1
0  A  53
1  B  52
2  C  53

In [7]:
# we can give our own index/labels---row
data=[['A',53],['B',52],['C',53]]
df=pd.DataFrame(data,index=[10,20,30])
df

    0   1
10  A  53
20  B  52
30  C  53

In [8]:
# If we want to assign the column name 
data=[['A',53],['B',52],['C',53]]
df=pd.DataFrame(data,index=[10,20,30],columns=['Name','Age'])
df

   Name  Age
10    A   53
20    B   52
30    C   53

## Create a DataFrame from Dict of Lists

In [9]:
data = {'Name':['Vishal'],
        'Age':[28]}
pd.DataFrame(data)
#when we use dict as an input then key becomes a column lable

     Name  Age
0  Vishal   28

In [10]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,30]}
pd.DataFrame(data)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   30

In [11]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,30]}
pd.DataFrame(data,columns=['Student','Rank'])
#if we try to change column names directly...it wont change

Empty DataFrame
Columns: [Student, Rank]
Index: []

In [12]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,30]}
pd.DataFrame(data,columns=['Name'])

    Name
0    Tom
1   Jack
2  Steve
3  Ricky

In [13]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29]}
pd.DataFrame(data)
#values in each row should match exactly otherwise exception

ValueError: arrays must all be same length

In [16]:
pd.DataFrame({'name':['Vishal','Kedar'],'age':[24,25]},index=[10,20,30,40])

ValueError: Shape of passed values is (2, 2), indices imply (4, 2)

In [18]:
#list of list
data = [['Tom', 'Jack', 'Steve', 'Ricky'],[28,34,29,30]]
pd.DataFrame(data,index=['Student','Rank'])

           0     1      2      3
Student  Tom  Jack  Steve  Ricky
Rank      28    34     29     30

In [22]:
data = [['Tom', 'Jack', 'Steve', 'Ricky'],[28,34,29,30]]
pd.DataFrame(data,index=['Student','Rank'],columns=list('abcd'))#columns=['a','b','c','d']

           a     b      c      d
Student  Tom  Jack  Steve  Ricky
Rank      28    34     29     30

In [23]:
data = [['Tom', 'Jack', 'Steve', 'Ricky'],[28,34,29,30]]
pd.DataFrame(data,index=['Student','Rank']).T

  Student Rank
0     Tom   28
1    Jack   34
2   Steve   29
3   Ricky   30

## DataFrame by passing a list of dictionaries

In [24]:
data=[{'a': 1, 'b': 2,'c':14},{'a': 5, 'b': 10, 'c': 20}]
data

[{'a': 1, 'b': 2, 'c': 14}, {'a': 5, 'b': 10, 'c': 20}]

In [25]:
df=pd.DataFrame(data)
df

   a   b   c
0  1   2  14
1  5  10  20

In [28]:
data=[{'a':10,'b':20,},{'a':40,'b':50,'c':60}]
df=pd.DataFrame(data)
df

    a   b     c
0  10  20   NaN
1  40  50  60.0

In [30]:
data=[{'a':10,'b':20},{'c':40,'d':50}]
df=pd.DataFrame(data,index=['first','second'])
df

           a     b     c     d
first   10.0  20.0   NaN   NaN
second   NaN   NaN  40.0  50.0

In [32]:
data=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
# when we dont want a column 'c' then specify only reuired columns
df=pd.DataFrame(data,index=['first','second'],columns=['a','b'])
df

        a  b
first   1  2
second  3  4

In [33]:
data=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
# when we dont want a column 'c' then specify only reuired columns
df=pd.DataFrame(data,index=['first','second'],columns=['b','a'])
df

        b  a
first   2  1
second  4  3

## Create a DataFrame from Dict of Series

In [36]:
data={'one':pd.Series([1,2,3,4,5]),'two':pd.Series([4,5,6,7,8])}
df=pd.DataFrame(data)
df

   one  two
0    1    4
1    2    5
2    3    6
3    4    7
4    5    8

In [42]:
# want to create a dataframe using only series
s=pd.Series([1,2,3,4,5])
pd.DataFrame(s,columns=['no'])

   no
0   1
1   2
2   3
3   4
4   5

### Creating Df using ndarray

In [43]:
import numpy as np
a = np.arange(2,26).reshape(6,4)
a

array([[ 2,  3,  4,  5],
       [ 6,  7,  8,  9],
       [10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21],
       [22, 23, 24, 25]])

In [44]:
df = pd.DataFrame(a)
df

    0   1   2   3
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [45]:
a = np.arange(2,26).reshape(6,4)
df = pd.DataFrame(a,columns=['A','B','C','D'])
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

### DataFrame properties and some operations

In [46]:
df.size

24

In [47]:
df.ndim

2

In [48]:
df.shape#rows and colums

(6, 4)

In [49]:
df.values

array([[ 2,  3,  4,  5],
       [ 6,  7,  8,  9],
       [10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21],
       [22, 23, 24, 25]])

In [50]:
df.empty

False

In [52]:
g = pd.DataFrame()
print(g)

Empty DataFrame
Columns: []
Index: []

In [53]:
g.empty

True

In [54]:
df.items

<bound method DataFrame.items of     A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25>

In [55]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [57]:
#top 3 entries==>5 entries default
df.head(3)

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [58]:
df.tail(2) #last 2 entries

    A   B   C   D
4  18  19  20  21
5  22  23  24  25

In [59]:
#Generate descriptive statistics.
#default it works on numeric data
df.describe()
#assignment== do the detailed study of describe

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   12.000000  13.000000  14.000000  15.000000
std     7.483315   7.483315   7.483315   7.483315
min     2.000000   3.000000   4.000000   5.000000
25%     7.000000   8.000000   9.000000  10.000000
50%    12.000000  13.000000  14.000000  15.000000
75%    17.000000  18.000000  19.000000  20.000000
max    22.000000  23.000000  24.000000  25.000000

In [60]:
#Print a concise summary of a DataFrame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
 3   D       6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

In [61]:
df =pd.DataFrame([{'a':1},{'a':2,'b':3}])
df

   a    b
0  1  NaN
1  2  3.0

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       1 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [63]:
#it will tell u total missing values/NaN present in specific columns
df.isnull().sum()

a    0
b    1
dtype: int64

## Selection, Addition and Deletion of Rows

In [64]:
a = np.arange(2,26).reshape(6,4)
df = pd.DataFrame(a,columns=['A','B','C','D'])
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

## Selection

In [65]:
df['A'] #gives values of column A

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int64

In [66]:
type(df['A'])

pandas.core.series.Series

In [67]:
df['A'].ndim

1

### Another approach

In [71]:
df.A #==>> df['A']

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int64

In [72]:
df.A.ndim

1

## Second approach to get df

In [68]:
df[['A']]

    A
0   2
1   6
2  10
3  14
4  18
5  22

In [69]:
type(df[['A']])

pandas.core.frame.DataFrame

In [70]:
df[['A']].ndim

2

# in order to select single column we have 3 options
    df.A=>Series=>1 dim   
    df['A']=>Series=>1 dim   
    df[['A']]=>Df=>2 dim

In [76]:
#if i want to select more than one column
df[['A','D']]

    A   D
0   2   5
1   6   9
2  10  13
3  14  17
4  18  21
5  22  25

In [77]:
df[['B','C']]

    B   C
0   3   4
1   7   8
2  11  12
3  15  16
4  19  20
5  23  24

In [78]:
df[['D','B','A']]

    D   B   A
0   5   3   2
1   9   7   6
2  13  11  10
3  17  15  14
4  21  19  18
5  25  23  22

In [79]:
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

## Indexing

In [83]:
df['A']#column names acts as an index

0     2
1     6
2    10
3    14
4    18
5    22
Name: A, dtype: int64

## Slicing

In [ ]:
[:]#rows
[:,:]#rows,columns
[::,::]

In [86]:
df[:3]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13

In [88]:
#fetch even index rows
df[::2]

    A   B   C   D
0   2   3   4   5
2  10  11  12  13
4  18  19  20  21

In [94]:
df[3:]

    A   B   C   D
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [98]:
# we r going to work on columns
df[:,:]
# not allowed

TypeError: '(slice(None, None, None), slice(None, None, None))' is an invalid key

### if we are using slicing on df==> we can fetch only rows==> it wont work similarly on columns

### Selection by label / loc[ ]==> vvimp point

In [99]:
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [101]:
df.loc[:,:]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [102]:
#i want all rows and only column B,D
df.loc[:,['B','D']]

    B   D
0   3   5
1   7   9
2  11  13
3  15  17
4  19  21
5  23  25

In [105]:
df.loc[:,'B':'D']
# here interesting fact is: stop is inclusive

    B   C   D
0   3   4   5
1   7   8   9
2  11  12  13
3  15  16  17
4  19  20  21
5  23  24  25

In [106]:
df.loc[:,'B':'C']

    B   C
0   3   4
1   7   8
2  11  12
3  15  16
4  19  20
5  23  24

In [107]:
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [108]:
df.loc[1:4]

    A   B   C   D
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21

In [113]:
df[-3:-1]

    A   B   C   D
3  14  15  16  17
4  18  19  20  21

### Selection by integer location / iloc [ ]

In [117]:
df.iloc[:,1:3]
#stop is exclusive

    B   C
0   3   4
1   7   8
2  11  12
3  15  16
4  19  20
5  23  24

In [120]:
df.iloc[:,0::2]

    A   C
0   2   4
1   6   8
2  10  12
3  14  16
4  18  20
5  22  24

In [122]:
df.iloc[:,1:]

    B   C   D
0   3   4   5
1   7   8   9
2  11  12  13
3  15  16  17
4  19  20  21
5  23  24  25

In [126]:
df.iloc[:,2:0:-1]

    C   B
0   4   3
1   8   7
2  12  11
3  16  15
4  20  19
5  24  23

In [127]:
df.iloc[:,[2,1]]

    C   B
0   4   3
1   8   7
2  12  11
3  16  15
4  20  19
5  24  23

In [131]:
# D C B A 
# rows: 1,3,5
df.iloc[1::2,[3,2,1,0]]#::-1

    D   C   B   A
1   9   8   7   6
3  17  16  15  14
5  25  24  23  22

In [133]:
df.iloc[[0,1,3,5]]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
3  14  15  16  17
5  22  23  24  25

### Slice operation on rows

In [ ]:
df[1:2]

In [ ]:
df[:-1]

### Slice operation on columns

### Addition using append

In [ ]:
import pandas as pd
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

### Delete row using drop

In [ ]:
df.drop(labels='b',axis=1)   # OR df.drop(index=1)
# here default axis=0 means row

### Delet column using label and axis=1

In [ ]:
df.drop('a',axis=1) # OR df.drop(labels='b',axis=1)
#axis=1 means column

### Delet column using columns attribute

In [ ]:
#df.drop(columns='b')
import numpy as np
df.iloc[1:3:,1::]=np.NaN
df

# Simplest way to directly create DataFrame is

In [ ]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3,4))
df